kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "usb_device.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

// Include headers for custom modules
#include "battery.h"
#include "cc1101.h"
#include "cc1101_config.h"
#include "ds3231.h"
#include "error_codes.h"
#include "flash_flag.h"
#include "frequency_config.h"
#include "led_feedback.h"
#include "log.h"
#include "opamps.h"
#include "radio.h"
#include "reed_solomon.h"
#include "relay.h"
#include "user_config.h"

// Standard library includes
#include <cmsis_gcc.h>
#include <math.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <stm32g431xx.h>
#include <stm32g4xx.h>
#include <stm32g4xx_hal.h>
#include <stm32g4xx_hal_dac.h>
#include <stm32g4xx_hal_def.h>
#include <stm32g4xx_hal_gpio.h>
#include <string.h>
#include <sys/_intsup.h>
#include <sys/types.h>
#include <unistd.h>
#include <usbd_cdc_if.h>

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define pi 3.14159265358979323846f

#define LEN_IF(cond, lit) ((cond) ? (sizeof(lit) - 1u) : 0u)

#define MAX_NUM_CHARS                                                          \
  (LEN_IF(INCLUDE_USER_STRING, "/STR" USER_STRING) +                           \
   LEN_IF(INCLUDE_DEVICE_ID, "/DID0000") +                                     \
   LEN_IF(INCLUDE_LOCATION, "/LOC00.0000,00.0000") +                           \
   LEN_IF(INCLUDE_TEMPERATURE, "/TMP000") +                                    \
   LEN_IF(INCLUDE_TIME, "/TIM00000000000000") + 4u)

#define MAX_PAYLOAD_BYTES (MAX_NUM_CHARS + RS_ERROR_CORRECTION_SYMBOLS)
#define BITSTREAM_LENGTH (1u + (MAX_PAYLOAD_BYTES * 8u) + 8u)

#define BIT_POLARITY 0

#define DS3231_ADDR (0x68 << 1) // 7-bit addr shifted for HAL
#define T4B_I2C_ADDR_7BIT 0x20
#define T4B_I2C_ADDR_HAL (T4B_I2C_ADDR_7BIT << 1) // 0x40 for HAL

#define DIV_FLOOR(n, d) ((uint32_t)((n) / (d)))
#define DIV_ROUND(n, d) ((uint32_t)(((n) + ((d) / 2u)) / (d)))

#define OUTPUT_SEGMENT 500
#define BUFFER_SIZE (OUTPUT_SEGMENT * 5)

#define SYNC_DELAY_MS 300

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

DAC_HandleTypeDef hdac1;
DMA_HandleTypeDef hdma_dac1_ch1;

I2C_HandleTypeDef hi2c2;

RTC_HandleTypeDef hrtc;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim6;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */

char input_string[MAX_NUM_CHARS] = {0};

uint8_t bitstream[BITSTREAM_LENGTH] = {0};

volatile uint8_t active_done = 0;

rtc_time_t now = {.seconds = 0,
                  .minutes = 0,
                  .hours = 0,
                  .day = 4,
                  .date = 1,
                  .month = 1,
                  .year = 1970};

int8_t temp_int = 25;

static uint32_t sine_val_low[LUT_LOW_SAMPLES];
static uint32_t sine_val_high[LUT_HIGH_SAMPLES];
static uint32_t dc_mid[LUT_LOW_SAMPLES];

// Pulse Calculation Variables
uint32_t fs = 0;
float total_time = 0.0;

// FSK
typedef struct {
  size_t bit_index;
  size_t current_period;
  size_t current_index;
} FillResult;

__ALIGN_BEGIN uint32_t output_buffer[BUFFER_SIZE] __ALIGN_END;

volatile bool tx_active = true;
volatile size_t current_bitstream_index = 0;
volatile size_t current_sine_period = 0;
volatile size_t current_sine_index = 0;
FillResult result;

uint8_t transmission[256] = {0};
int dBm_value = 0;

freq_pair_t freq_pair = {0};

volatile status_code_t g_error_code = STATUS_CODE_OK;

extern volatile uint8_t cdc_rx_buf[64];
extern volatile uint8_t cdc_rx_len;

uint32_t wake_up_tick = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
static void MX_DAC1_Init(void);
static void MX_I2C2_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM6_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_RTC_Init(void);
/* USER CODE BEGIN PFP */

void EnterStopMode(void);
void calculate_active_duration_ms(size_t bitstream_len);
void StartActiveWindowMs(uint32_t ms);
void make_bitstream_from_bytes(const uint8_t *data, size_t length);
void update_input_string(void);
int make_preamble(int start_idx);
void get_sineval_low(void);
void get_sineval_high(void);
void get_dc_mid(void);
uint32_t get_dac_sample_rate_hz(void);
static void RTC_SetWakeupTimer(uint32_t seconds);

static void start_audio_arm(void);
static void start_audio_trigger(void);
static void stop_audio_transmission(void);

void app_radio_test(void);

void read_buffer(void);

void process_transmission(uint8_t *transmission, int *dBm_value);

void create_payload_string(const char *user_str, int device_id,
                           const char *location, int8_t temperature,
                           rtc_time_t time, uint8_t *output_str,
                           size_t output_str_size);

