kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
void create_string_from_received_data(const uint8_t *transmission,
                                      int dBm_value, uint8_t *output_str,
                                      size_t output_str_size);

static int init_luts_from_freqpair(void);

void Error_Handler_Code(status_code_t code);

void TryReceiveTimeSync(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick.
   */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_DAC1_Init();
  MX_I2C2_Init();
  MX_TIM2_Init();
  MX_TIM6_Init();
  MX_USART2_UART_Init();
  MX_RTC_Init();
  MX_USB_Device_Init();
  /* USER CODE BEGIN 2 */

  if (OPERATION_MODE == 0) {
    LOGF("Starting in RX mode\r\n");
  } else if (OPERATION_MODE == 1) {
    LOGF("Starting in TX mode\r\n");
  } else {
    LOGF("Starting in Standalone mode\r\n");
  }

  //-----------------------------------------------------------------------------//
  // Set DAC output to mid-level (silence) before starting for RX and Standalone
  //-----------------------------------------------------------------------------//

  if (OPERATION_MODE == 0 || OPERATION_MODE == 2) {
    DAC_SetMidlevel(&hdac1, 2048);
  }

  //-----------------------------------------------------------------------------//
  // Initialize UART logging
  //-----------------------------------------------------------------------------//

  LOGF("\r\n");
  LOGF("UART boot OK\r\n");
  HAL_Delay(200);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  //-----------------------------------------------------------------------------//
  // Initialize RTC
  //-----------------------------------------------------------------------------//

  if (!FlashFlag_TimeWasSet()) {
    TryReceiveTimeSync();

    FlashFlag_SetTimeWasSet();
  }

  DS3231_PowerOn();
  DS3231_GetTime(&now);
  DS3231_ReadTemperature(&temp_int);
  DS3231_PowerOff();

  LOGF("-------------------------\r\n");
  LOGF("\r\n");

  //-----------------------------------------------------------------------------//
  // Check battery voltage and go back to sleep if low
  //-----------------------------------------------------------------------------//

  Battery_IsLow(&hadc1);

  //-----------------------------------------------------------------------------//
  // Get DAC sample rate and log it
  //-----------------------------------------------------------------------------//

  uint32_t dac_sample_rate = get_dac_sample_rate_hz();
  LOGF("DAC sample rate: %lu Hz\r\n", (unsigned long)dac_sample_rate);
  LOGF("\r\n");

  //-----------------------------------------------------------------------------//
  // Find and set FSK frequencies based on user config and sample count
  // requirements (RX and Standalone modes)
  //-----------------------------------------------------------------------------//
  if (OPERATION_MODE != 1) {
    freq_pair = FreqConfig_FindFreqPair(dac_sample_rate);

    LOGF("Frequency pair: lower=%u Hz, higher=%u Hz\r\n",
         (unsigned int)freq_pair.lower_freq,
         (unsigned int)freq_pair.higher_freq);
    LOGF("--------------------------\r\n");
    LOGF("\r\n");
  } else {
    LOGF("Skipping finding frequencies\r\n");
  }

  //-----------------------------------------------------------------------------//
  // Prepare sine wave lookup tables
  //-----------------------------------------------------------------------------//

  if (OPERATION_MODE != 1) {
    if (init_luts_from_freqpair() != 0) {
      LOGF("LUT alloc failed\r\n");
      LOGF("--------------------------\r\n");
      Error_Handler_Code(STATUS_CODE_LUT_ALLOC_FAIL);
    }

    get_sineval_low();
    get_sineval_high();
    get_dc_mid();
  } else {
    LOGF("Skipping LUT preparation \r\n");
  }

  //-----------------------------------------------------------------------------//
  // Initialize radio for RX or TX mode
  //-----------------------------------------------------------------------------//

  if (OPERATION_MODE != 2) {
    HAL_Delay(20);
    int8_t init_result = Radio_Init(OPERATION_MODE);
    if (init_result != 0) {
      LOGF("Failed to initialize radio in %s mode, error code: %d\r\n",
           OPERATION_MODE == 0 ? "RX" : "TX", init_result);
      LOGF("--------------------------\r\n");
      LOGF("\r\n");
      Error_Handler_Code(init_result);
    }
  } else {
    LOGF("No radio in standalone mode - skipping radio initialization\r\n");
  }

  //-----------------------------------------------------------------------------//
  // Configure RX or TX mode
  //-----------------------------------------------------------------------------//

  if (OPERATION_MODE == 0) {
    Relay_SetBypassMode();
  } else {
    LOGF("Setting first alarm for TX and Standalone mode\r\n");
    // TODO: ajust timer to match user config for transmission intervals
    RTC_SetWakeupTimer(60);
  }

  //-----------------------------------------------------------------------------//
  // Indicate boot complete with LED blinks
  //-----------------------------------------------------------------------------//

  LED_BlinkStatusCode(STATUS_CODE_OK); // code 0 = "0000" = 4 short blinks

  //-----------------------------------------------------------------------------//
  // Main loop
  //-----------------------------------------------------------------------------//
  LOGF("\r\n");
  LOGF("Entering main loop...\r\n");
  LOGF("\r\n");

  while (1) {
    // 1) Enter STOP mode and wait for wakeup from EXTI (GPIOB Pin 7)
    LOGF("Entering STOP mode...\r\n");
    EnterStopMode();

    // 2) Check battery voltage and go back to sleep if low
    Battery_IsLow(&hadc1);
    DS3231_PowerOn();

