kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
    if (OPERATION_MODE == 0) {
      LOGF("Woke up for RX reception\r\n");

      // RX mode: read from radio and store in string
      int rx_len = Radio_Receive(transmission, sizeof(transmission));
      if (rx_len <= 4 || memchr(transmission, '/', rx_len) == NULL) {
        Radio_EnterWOR();
        continue;
      }
      // Process received transmission
      process_transmission(transmission, &dBm_value);

      // 2) Get current time from RTC
      DS3231_GetTime(&now);
      DS3231_ReadTemperature(&temp_int);
      DS3231_PowerOff();

      // Create output string based on received data (e.g.
      // "/TIM.../STR.../DID.../LOC.../TMP...")
      uint8_t output_str[256] = {0};
      create_string_from_received_data(transmission, dBm_value, output_str,
                                       sizeof(output_str));

      size_t payload_len = strlen((char *)output_str);

      if (USE_REED_SOLOMON_ERROR_CORRECTION) {
        // Prepare buffer for Reed-Solomon codeword (message + parity)
        uint8_t codeword[payload_len + RS_ERROR_CORRECTION_SYMBOLS];
        memset(codeword, 0, sizeof(codeword));

        // Encode the output string using Reed-Solomon
        RS_EncodeMsg((const uint8_t *)output_str, (int)payload_len, codeword,
                     RS_ERROR_CORRECTION_SYMBOLS);

        // Set output_str to the codeword for transmission (truncated to fit if
        // necessary)
        size_t codeword_len = payload_len + RS_ERROR_CORRECTION_SYMBOLS;
        if (codeword_len > sizeof(output_str)) {
          codeword_len = sizeof(output_str);
        }
        memcpy(output_str, codeword, codeword_len);
        payload_len = codeword_len;
      }

      // Make bitstream from output string
      make_bitstream_from_bytes(output_str, payload_len);

      calculate_active_duration_ms(BITSTREAM_LENGTH);
      uint32_t total_ms = (uint32_t)(total_time * 1000.0f);

      if (USE_CABLE_TRANSMISSION) {
        Opamps_Enable(&hdac1);
        Relay_SetMixingMode();
      } else {
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_SET);
        HAL_Delay(100);
      }

      start_audio_arm();

      uint32_t target_tick = wake_up_tick + SYNC_DELAY_MS;
      int32_t wait_ms = (int32_t)(target_tick - HAL_GetTick());
      LOGF("Sync wait: %ld ms\r\n", wait_ms);
      if (wait_ms > 1) {
        HAL_Delay((uint32_t)(wait_ms - 1));
      }
      while (__HAL_UART_GET_FLAG(&huart2, UART_FLAG_TC) == RESET)
        ;
      __HAL_UART_DISABLE(&huart2);
      while (HAL_GetTick() < target_tick)
        ;
      (void)SysTick->CTRL; // clear COUNTFLAG by reading it
      // Now align to the next SysTick rollover for sub-ms precision
      // SysTick counts DOWN from LOAD to 0, then reloads - catch the reload
      // moment
      while ((SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) == 0)
        ;
      start_audio_trigger();
      __HAL_UART_ENABLE(&huart2);

      // Wait for active window to complete (enters low-power sleep while
      // waiting)
      StartActiveWindowMs((uint32_t)(total_ms));

      uint32_t last_toggle = HAL_GetTick();
      while (!active_done) {
        uint32_t now = HAL_GetTick();
        if ((now - last_toggle) >= 100) { // blink every 100 ms
          last_toggle = now;
          LED_Toggle();
        }
        __WFI(); // CPU sleeps while DMA+TIM2+DAC run
      }
      active_done = 0;
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);

      // Stop transmission and go back to sleep
      stop_audio_transmission();

      Radio_EnterWOR();

    } else if (OPERATION_MODE == 1) {
      LOGF("Woke up for TX transmission\r\n");
      // Send transmission over radio
      LOGF("Starting transmission over radio...\r\n");
      LED_BlinkStatusCode(STATUS_CODE_STARTING_TRANSMISSION);
      Radio_Transmit();

      uint32_t target_interval_s;

      if (USE_DEFAULT_INTERVAL_BETWEEN_REPEATS) {
        target_interval_s = 60;
      } else {
        target_interval_s = INTERVAL_BETWEEN_REPEATS_MINUTES * 60;
      }

      uint32_t elapsed_ms = HAL_GetTick() - wake_up_tick;
      uint32_t elapsed_s = elapsed_ms / 1000;

      uint32_t sleep_seconds;
      if (elapsed_s >= target_interval_s) {
        sleep_seconds = 1;
      } else {
        uint32_t remainder_ms = elapsed_ms % 1000;

        if (remainder_ms != 0) {
          HAL_Delay(1000 - remainder_ms);
        }

        static uint32_t cycle_count = 0;
        cycle_count++;

        if ((cycle_count % 4) == 0) {
          sleep_seconds = target_interval_s - elapsed_s - 2;
        } else {
          sleep_seconds = target_interval_s - elapsed_s - 3;
        }
      }

      LOGF("Elapsed awake time: %lu ms\r\n", (unsigned long)elapsed_ms);
      LOGF("Sleeping for %lu s\r\n", (unsigned long)sleep_seconds);

      LOGF("Going back to sleep...\r\n");

      RTC_SetWakeupTimer(sleep_seconds);
    } else {
      LOGF("Woke up for Standalone mode\r\n");

      // 1) Get current time and temperature from RTC
      DS3231_PowerOn();
      DS3231_GetTime(&now);
      DS3231_ReadTemperature(&temp_int);
      DS3231_PowerOff();

      // Create output string based on received data (e.g.
      // "/TIM.../STR.../DID.../LOC.../TMP...")
      uint8_t output_str[256] = {0};
      create_payload_string(INCLUDE_USER_STRING ? USER_STRING : NULL,
                            INCLUDE_DEVICE_ID ? DEVICE_ID : -1,
                            INCLUDE_LOCATION ? LOCATION : NULL,
                            INCLUDE_TEMPERATURE ? temp_int : -1, now,
                            output_str, sizeof(output_str));

      size_t payload_len = strlen((char *)output_str);

      if (USE_REED_SOLOMON_ERROR_CORRECTION) {
        // Prepare buffer for Reed-Solomon codeword (message + parity)
        uint8_t codeword[payload_len + RS_ERROR_CORRECTION_SYMBOLS];
        memset(codeword, 0, sizeof(codeword));

        // Encode the output string using Reed-Solomon
        RS_EncodeMsg((const uint8_t *)output_str, (int)payload_len, codeword,
                     RS_ERROR_CORRECTION_SYMBOLS);

        // Set output_str to the codeword for transmission (truncated to fit
        // if necessary)
        size_t codeword_len = payload_len + RS_ERROR_CORRECTION_SYMBOLS;
        if (codeword_len > sizeof(output_str)) {
          codeword_len = sizeof(output_str);
        }
        memcpy(output_str, codeword, codeword_len);
        payload_len = codeword_len;
      }

      // Make bitstream from output string
      make_bitstream_from_bytes(output_str, payload_len);

      calculate_active_duration_ms(BITSTREAM_LENGTH);
      uint32_t total_ms = (uint32_t)(total_time * 1000.0f);

      if (USE_CABLE_TRANSMISSION) {
        Opamps_Enable(&hdac1);
        Relay_SetMixingMode();
      } else {
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_SET);
        HAL_Delay(100);
      }

      start_audio_arm();
      start_audio_trigger();

      // Wait for active window to complete (enters low-power sleep while
      // waiting)
      StartActiveWindowMs((uint32_t)(total_ms));

