kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
  DBGMCU->CR &=
      ~(DBGMCU_CR_DBG_STOP | DBGMCU_CR_DBG_SLEEP | DBGMCU_CR_DBG_STANDBY);

  if (OPERATION_MODE == 0) {
    HAL_RTCEx_DeactivateWakeUpTimer(&hrtc);
    HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);
  } else {
    HAL_NVIC_DisableIRQ(EXTI9_5_IRQn);
    HAL_NVIC_EnableIRQ(RTC_WKUP_IRQn);
  }

  __DSB();
  __ISB();
  HAL_SuspendTick();
  HAL_PWREx_EnterSTOP1Mode(PWR_STOPENTRY_WFI);

  SystemClock_Config();
  HAL_ResumeTick();
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_SET);
  MX_I2C2_Init();
  MX_USART2_UART_Init();
  HAL_Delay(10);
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_15, GPIO_PIN_RESET);
  wake_up_tick = HAL_GetTick();

  // RX only: wait for GDO0 to deassert after wakeup
  if (OPERATION_MODE == 0) {
    uint32_t settle = HAL_GetTick();
    while (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_7) == GPIO_PIN_RESET &&
           HAL_GetTick() - settle < 5) {
    }
  }

  HAL_NVIC_EnableIRQ(EXTI9_5_IRQn);
  if (OPERATION_MODE == 0) {
    __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_7);
    HAL_NVIC_ClearPendingIRQ(EXTI9_5_IRQn);
  } else {
    __HAL_RTC_WAKEUPTIMER_CLEAR_FLAG(&hrtc, RTC_FLAG_WUTF);
  }
  __HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);
  PWR->SCR = PWR_SCR_CWUF;
}

void StartActiveWindowMs(uint32_t ms) {
  active_done = 0;

  if (ms == 0) {
    ms = 1;
  }

  HAL_TIM_Base_Stop_IT(&htim6);
  __HAL_TIM_SET_COUNTER(&htim6, 0);
  __HAL_TIM_SET_AUTORELOAD(&htim6, ms - 1);

  __HAL_TIM_CLEAR_FLAG(&htim6, TIM_FLAG_UPDATE);
  __HAL_TIM_CLEAR_IT(&htim6, TIM_IT_UPDATE);

  HAL_TIM_Base_Start_IT(&htim6);
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
  if (htim->Instance == TIM6) {
    HAL_TIM_Base_Stop_IT(&htim6); // <- makes it one-shot reliably
    active_done = 1;
  }
}

int make_preamble(int start_idx) {
  int k = start_idx;
  uint16_t id = 0x2DD4;
  for (int i = 0; i < 16 && k < BITSTREAM_LENGTH; ++i) {
    bitstream[k++] = (((id >> (15 - i)) & 1) ^ BIT_POLARITY);
  }

  return k;
}
void make_bitstream_from_bytes(const uint8_t *data, size_t length) {
  size_t k = 0;

  if (k < BITSTREAM_LENGTH) {
    bitstream[k++] = 2; // silence
  }

  for (size_t i = 0; i < length && k < BITSTREAM_LENGTH; ++i) {
    for (int b = 7; b >= 0 && k < BITSTREAM_LENGTH; --b) {
      bitstream[k++] = (uint8_t)(((data[i] >> b) & 1u) ^ BIT_POLARITY);
    }
  }

  for (int i = 0; i < 8 && k < BITSTREAM_LENGTH; ++i) {
    bitstream[k++] = 2; // silence
  }

  while (k < BITSTREAM_LENGTH) {
    bitstream[k++] = 2; // silence
  }
}

void update_input_string(void) {
  input_string[0] = '\0';
  size_t offset = 0;
  size_t remaining = MAX_NUM_CHARS;
  int n = 0;

  // Append USER_STRING if enabled
  if (INCLUDE_USER_STRING) {
    n = snprintf(&input_string[offset], remaining, "/STR%s", USER_STRING);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Append DEVICE_ID if enabled
  if (INCLUDE_DEVICE_ID) {
    n = snprintf(&input_string[offset], remaining, "%s/DID%d",
                 (offset > 0) ? "" : "", DEVICE_ID);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Append LOCATION if enabled
  if (INCLUDE_LOCATION) {
    n = snprintf(&input_string[offset], remaining, "%s/LOC%s",
                 (offset > 0) ? "" : "", LOCATION);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Append TEMPERATURE if enabled
  if (INCLUDE_TEMPERATURE) {
    n = snprintf(&input_string[offset], remaining, "%s/TMP%d",
                 (offset > 0) ? "" : "", temp_int);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Append TIME if enabled
  if (INCLUDE_TIME) {
    n = snprintf(&input_string[offset], remaining,
                 "%s/TIM%02d%02d%02d%02d%02d%02d%04d", (offset > 0) ? "" : "",
                 now.hours, now.minutes, now.seconds, now.day, now.date,
                 now.month, now.year);

    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Add termination sign
  if (strlen(input_string) > 0) {
    n = snprintf(&input_string[offset], remaining, "/");
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
}

// Function to generate sine wave lookup table for low frequency
void get_sineval_low(void) {
  if (!sine_val_low || freq_pair.lower_freq_samples == 0) {
    return; // eller Error_Handler()
  }

  const float dac_max = 4095.0f;
  const float dac_mid = dac_max / 2.0f;
  const float amplitude = (1.5f / 1.65f) * (SIGNAL_ATTENUATION / 100.0f);

  for (uint16_t i = 0; i < freq_pair.lower_freq_samples; i++) {
    sine_val_low[i] =
        (uint32_t)(dac_mid *
                   (1.0 + sinf(2.0 * pi * i / freq_pair.lower_freq_samples) *
                              amplitude));
  }
}

// Function to generate sine wave lookup table for the high frequency
void get_sineval_high(void) {
  if (!sine_val_high || freq_pair.higher_freq_samples == 0) {
    return; // eller Error_Handler()
  }

  const float dac_max = 4095.0f;
  const float dac_mid = dac_max / 2.0f;
  const float amplitude = (1.5f / 1.65f) * (SIGNAL_ATTENUATION / 100.0f);

  for (uint16_t i = 0; i < freq_pair.higher_freq_samples; i++) {
    sine_val_high[i] =
        (uint32_t)(dac_mid *
                   (1.0 + sinf(2.0 * pi * i / freq_pair.higher_freq_samples) *
                              amplitude));
  }
}

void get_dc_mid(void) {
  if (!dc_mid || freq_pair.lower_freq_samples == 0) {
    return; // eller Error_Handler()
  }

  uint32_t mid_value = (uint32_t)(4095.0 / 2.0);
  for (uint16_t i = 0; i < freq_pair.lower_freq_samples; i++) {
    dc_mid[i] = mid_value;
  }
}

uint32_t get_dac_sample_rate_hz(void) {
  uint32_t tim_clk = HAL_RCC_GetPCLK1Freq();
  if ((RCC->CFGR & RCC_CFGR_PPRE1) != RCC_CFGR_PPRE1_DIV1)
    tim_clk *= 2; // timer clock doubled if APB prescaler != 1

  return tim_clk / ((htim2.Init.Prescaler + 1) * (htim2.Init.Period + 1));
}

