kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
void calculate_active_duration_ms(size_t bitstream_len) {
  fs = get_dac_sample_rate_hz();

  float f_0 = (float)fs / (float)freq_pair.lower_freq_samples;
  float f_1 = (float)fs / (float)freq_pair.higher_freq_samples;

  float f_0_bit_duration = (float)freq_pair.lower_freq_periods / f_0;
  float f_1_bit_duration = (float)freq_pair.higher_freq_periods / f_1;

  // Exact bitstream time
  total_time = 0.0f;
  for (int i = 0; i < bitstream_len; ++i) {
    if (bitstream[i] == 0) {
      total_time += f_0_bit_duration;
    } else if (bitstream[i] == 1) {
      total_time += f_1_bit_duration;
    } else {
      total_time += f_0_bit_duration; // silence
    }
  }

  // Add silence time
  // total_time *= 1.05f;                            // 5% margin
}

static inline FillResult
fill_half_buffer(uint32_t *buffer, size_t generation_size,
                 const uint8_t *bitstream, size_t bitstream_len,
                 size_t bit_index, size_t current_sine_period,
                 size_t current_sine_index) {
  size_t out = 0;
  size_t period = current_sine_period;
  size_t idx = current_sine_index;

  while (out < generation_size) {
    // If finished, just output mid forever (prevents repeats)
    if (bit_index >= bitstream_len) {
      for (; out < generation_size; ++out) {
        buffer[out] = dc_mid[0];
      }
      break;
    }

    uint8_t cur_bit = bitstream[bit_index];

    /* Select LUT + target periods for THIS bit */
    const uint32_t *lut;
    size_t lut_len;
    size_t target_periods;

    if (cur_bit == 0) {
      lut = sine_val_low;
      lut_len = freq_pair.lower_freq_samples;
      target_periods = freq_pair.lower_freq_periods;
    } else if (cur_bit == 1) {
      lut = sine_val_high;
      lut_len = freq_pair.higher_freq_samples;
      target_periods = freq_pair.higher_freq_periods;
    } else { // silence
      lut = dc_mid;
      lut_len = freq_pair.lower_freq_samples;
      target_periods = freq_pair.lower_freq_periods;
    }

    /* Copy as much as we can from current LUT position */
    size_t left_buf = generation_size - out;
    size_t left_lut = lut_len - idx;
    size_t n = (left_buf < left_lut) ? left_buf : left_lut;

    memcpy(&buffer[out], &lut[idx], n * sizeof(uint32_t));
    out += n;
    idx += n;

    /* Completed one period? */
    if (idx == lut_len) {
      idx = 0;
      period++;

      /* Completed this bit? -> advance to next bit */
      if (period == target_periods) {
        period = 0;
        if (bit_index + 1u < bitstream_len) {
          bit_index++;
        } else {
          // reached end -> hold at end
          bit_index = bitstream_len;
        }
      }
    }
  }

  return (FillResult){
      .bit_index = bit_index, .current_period = period, .current_index = idx};
}

// DMA Half Transfer Complete callback
void HAL_DAC_ConvHalfCpltCallbackCh1(DAC_HandleTypeDef *hdac) {
  if (!tx_active)
    return;

  FillResult r =
      fill_half_buffer((uint32_t *)&output_buffer[0], BUFFER_SIZE / 2,
                       bitstream, BITSTREAM_LENGTH, current_bitstream_index,
                       current_sine_period, current_sine_index);

  current_bitstream_index = r.bit_index;
  current_sine_period = r.current_period;
  current_sine_index = r.current_index;
}

// DMA Transfer Complete callback
void HAL_DAC_ConvCpltCallbackCh1(DAC_HandleTypeDef *hdac) {
  if (!tx_active)
    return;

  FillResult r = fill_half_buffer((uint32_t *)&output_buffer[BUFFER_SIZE / 2],
                                  BUFFER_SIZE / 2, bitstream, BITSTREAM_LENGTH,
                                  current_bitstream_index, current_sine_period,
                                  current_sine_index);

  current_bitstream_index = r.bit_index;
  current_sine_period = r.current_period;
  current_sine_index = r.current_index;
}

static void start_audio_arm(void) {
  // LOGF("\r\nTX_Arm()\r\n");

  current_bitstream_index = 0;
  current_sine_period = 0;
  current_sine_index = 0;
  tx_active = true;

  FillResult r1 =
      fill_half_buffer((uint32_t *)&output_buffer[0], BUFFER_SIZE / 2,
                       bitstream, BITSTREAM_LENGTH, current_bitstream_index,
                       current_sine_period, current_sine_index);

  current_bitstream_index = r1.bit_index;
  current_sine_period = r1.current_period;
  current_sine_index = r1.current_index;

  FillResult r2 = fill_half_buffer((uint32_t *)&output_buffer[BUFFER_SIZE / 2],
                                   BUFFER_SIZE / 2, bitstream, BITSTREAM_LENGTH,
                                   current_bitstream_index, current_sine_period,
                                   current_sine_index);

  current_bitstream_index = r2.bit_index;
  current_sine_period = r2.current_period;
  current_sine_index = r2.current_index;

  // LOGF("  Buffer filled\r\n");

  // Clean start
  HAL_TIM_Base_Stop(&htim2);
  HAL_DAC_Stop_DMA(&hdac1, DAC_CHANNEL_1);

  DMA1->IFCR =
      DMA_IFCR_CGIF1 | DMA_IFCR_CTCIF1 | DMA_IFCR_CHTIF1 | DMA_IFCR_CTEIF1;
  NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);

  // LOGF("  Peripherals stopped & DMA flags cleared\r\n");

  HAL_StatusTypeDef st =
      HAL_DAC_Start_DMA(&hdac1, DAC_CHANNEL_1, (uint32_t *)output_buffer,
                        BUFFER_SIZE, DAC_ALIGN_12B_R);

  if (st != HAL_OK) {
    LOGF("  HAL_DAC_Start_DMA error: %d\r\n", st);
    Error_Handler_Code(STATUS_CODE_TRANSMISSION_ERROR);
  } else {
    // LOGF("  HAL_DAC_Start_DMA OK\r\n");
  }

  // Ensure trigger enabled; TIM2 not started yet
  SET_BIT(DAC1->CR, DAC_CR_TEN1);
}

static void start_audio_trigger(void) {
  __HAL_TIM_SET_COUNTER(&htim2, 0);
  HAL_StatusTypeDef st = HAL_TIM_Base_Start(&htim2);
  if (st != HAL_OK) {
    LOGF("  HAL_TIM_Base_Start error: %d\r\n", st);
    Error_Handler_Code(STATUS_CODE_TRANSMISSION_ERROR);
  } else {
    LOGF("  HAL_TIM_Base_Start OK\r\n");
  }
}

static void stop_audio_transmission(void) {
  tx_active = false;

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_RESET);
  Relay_SetBypassMode();

  // Stop trigger + DMA first
  HAL_TIM_Base_Stop(&htim2);
  HAL_DAC_Stop_DMA(&hdac1, DAC_CHANNEL_1);

  Opamps_Disable(&hdac1);

  // Optional: if you want to *keep* the mid DC during STOP, leave DAC
  // running. If you want lowest power, stop it (output may go undefined
  // depending on buffer mode): HAL_DAC_Stop(&hdac1, DAC_CHANNEL_1);

