kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
  DMA1->IFCR =
      DMA_IFCR_CGIF1 | DMA_IFCR_CTCIF1 | DMA_IFCR_CHTIF1 | DMA_IFCR_CTEIF1;
  NVIC_ClearPendingIRQ(DMA1_Channel1_IRQn);
}

void string_to_hex(const char *str, uint8_t *hex_buf, size_t hex_buf_size) {
  size_t str_len = strlen(str);
  size_t max_bytes =
      (hex_buf_size < (str_len / 2)) ? hex_buf_size : (str_len / 2);

  for (size_t i = 0; i < max_bytes; i++) {
    sscanf(&str[i * 2], "%2hhx", &hex_buf[i]);
  }
}

void process_transmission(uint8_t *transmission, int *dBm_value) {
  size_t len = strlen((const char *)transmission);
  if (len <= 4) {
    LOGF("Transmission too short to process.\r\n");
    return;
  }

  uint8_t rssi_hex = transmission[len - 2]; // 2nd from end

  int8_t rssi_signed = (int8_t)rssi_hex; // 2's complement

  int rssi_dbm = (rssi_signed / 2) - 74; // integer dBm

  dBm_value[0] = (int)rssi_dbm;

  // Create cleaned string: skip first 2 char, skip last 2 chars
  size_t cleaned_len = (len > 4) ? (len - 4) : 0;
  char cleaned_str[MAX_NUM_CHARS] = {0};
  if (cleaned_len > 0) {
    strncpy(cleaned_str, (const char *)transmission + 2, cleaned_len);
    cleaned_str[cleaned_len] = '\0'; // Null-terminate
  }

  // Overwrite the transmission parameter (cast needed for const)
  strncpy((char *)transmission, cleaned_str, MAX_NUM_CHARS - 1);
}

void create_payload_string(const char *user_str, int device_id,
                           const char *location, int8_t temperature,
                           rtc_time_t time_val, uint8_t *output_str,
                           size_t output_str_size) {
  if (!output_str || output_str_size == 0)
    return;

  char temp_buf[256] = {0};
  size_t offset = 0;
  size_t remaining = sizeof(temp_buf);
  int n = 0;

  output_str[0] = '\0';

  if (INCLUDE_TIME) {
    n = snprintf(&temp_buf[offset], remaining,
                 "%s/TIM%02d%02d%02d%02d%02d%02d%04d", (offset > 0) ? "" : "",
                 time_val.hours, time_val.minutes, time_val.seconds,
                 time_val.day, time_val.date, time_val.month, time_val.year);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  if (INCLUDE_USER_STRING) {
    n = snprintf(&temp_buf[offset], remaining, "/STR%s", user_str);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  if (INCLUDE_DEVICE_ID) {
    n = snprintf(&temp_buf[offset], remaining, "%s/DID%d",
                 (offset > 0) ? "" : "", device_id);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  if (INCLUDE_LOCATION) {
    n = snprintf(&temp_buf[offset], remaining, "%s/LOC%s",
                 (offset > 0) ? "" : "", location);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  if (INCLUDE_TEMPERATURE) {
    n = snprintf(&temp_buf[offset], remaining, "%s/TMP%d",
                 (offset > 0) ? "" : "", temperature);
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Add termination slash
  if (strlen(temp_buf) > 0) {
    n = snprintf(&temp_buf[offset], remaining, "/");
    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }
  // Hard guarantee null-termination
  output_str[output_str_size - 1] = '\0';
  // Copy ASCII bytes into uint8_t output buffer
  size_t out_len = strnlen(temp_buf, sizeof(temp_buf));
  if (out_len >= output_str_size) {
    out_len = output_str_size - 1;
  }
  memcpy(output_str, temp_buf, out_len);
  output_str[out_len] = 0x00;
}

void create_string_from_received_data(const uint8_t *transmission,
                                      int dBm_value, uint8_t *output_str,
                                      size_t output_str_size) {
  if (!transmission || !output_str || output_str_size == 0)
    return;

  // Defaults (fallback if missing in RX packet)
  char user_string[64] = USER_STRING;
  int device_id = DEVICE_ID;
  char location[64] = LOCATION;
  int8_t temperature = temp_int;
  rtc_time_t time_val = now;

  // Make local copy for strtok (DO NOT modify input buffer)
  char buf[256] = {0};
  strncpy(buf, (const char *)transmission, sizeof(buf) - 1);

  // Parse tokens
  for (char *tok = strtok(buf, "/"); tok != NULL; tok = strtok(NULL, "/")) {
    if (strncmp(tok, "TIM", 3) == 0) {
      const char *p = tok + 3;

      if (strlen(p) >= 16) {
        char tmp[5] = {0};

        tmp[0] = p[0];
        tmp[1] = p[1];
        time_val.hours = atoi(tmp);

        tmp[0] = p[2];
        tmp[1] = p[3];
        time_val.minutes = atoi(tmp);

        tmp[0] = p[4];
        tmp[1] = p[5];
        time_val.seconds = atoi(tmp);

        tmp[0] = p[6];
        tmp[1] = p[7];
        time_val.day = atoi(tmp);

        tmp[0] = p[8];
        tmp[1] = p[9];
        time_val.date = atoi(tmp);

        tmp[0] = p[10];
        tmp[1] = p[11];
        time_val.month = atoi(tmp);

        tmp[0] = p[12];
        tmp[1] = p[13];
        tmp[2] = p[14];
        tmp[3] = p[15];
        time_val.year = atoi(tmp);
      }
    } else if (strncmp(tok, "STR", 3) == 0) {
      strncpy(user_string, tok + 3, sizeof(user_string) - 1);
    } else if (strncmp(tok, "DID", 3) == 0) {
      device_id = atoi(tok + 3);
    } else if (strncmp(tok, "LOC", 3) == 0) {
      strncpy(location, tok + 3, sizeof(location) - 1);
    } else if (strncmp(tok, "TMP", 3) == 0) {
      temperature = (int8_t)atoi(tok + 3);
    }
  }

  create_payload_string(user_string, device_id, location, temperature, time_val,
                        output_str, output_str_size);
}

static int init_luts_from_freqpair(void) {
  if (freq_pair.lower_freq_samples > LUT_LOW_SAMPLES ||
      freq_pair.higher_freq_samples > LUT_HIGH_SAMPLES) {
    return -1;
  }
  return 0;
}

