kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
void Error_Handler_Code(status_code_t code) {
  g_error_code = code;
  // Error_Handler(); // call the CubeMX-compatible one
}

// int _write(int file, char *ptr, int len) {
//   (void)file;
//   HAL_UART_Transmit(&huart2, (uint8_t *)ptr, len, 100);
//   return len;
// }

int _write(int file, char *ptr, int len) {
  (void)file;
  HAL_UART_Transmit(&huart2, (uint8_t *)ptr, len, 100);
  uint32_t start = HAL_GetTick();
  while (CDC_Transmit_FS((uint8_t *)ptr, len) == USBD_BUSY) {
    if (HAL_GetTick() - start > 10)
      break;
  }
  return len;
}

static void RTC_SetWakeupTimer(uint32_t seconds) {
  HAL_RTCEx_DeactivateWakeUpTimer(&hrtc);
  __HAL_RTC_WAKEUPTIMER_CLEAR_FLAG(&hrtc, RTC_FLAG_WUTF);

  if (seconds == 0) {
    seconds = 1;
  }

  if (HAL_RTCEx_SetWakeUpTimer_IT(&hrtc, seconds - 1,
                                  RTC_WAKEUPCLOCK_CK_SPRE_16BITS) != HAL_OK) {
    Error_Handler_Code(STATUS_CODE_UNKNOWN_ERROR);
  }
}

void TryReceiveTimeSync(void) {
  LOGF("Waiting for time sync (10s)...\r\n");

  char buf[32] = {0};
  uint32_t start = HAL_GetTick();

  while (HAL_GetTick() - start < 10000) {
    if (cdc_rx_len > 0) {
      uint8_t len = cdc_rx_len;
      cdc_rx_len = 0; // clear immediately

      memcpy(buf, (uint8_t *)cdc_rx_buf, len);
      buf[len] = '\0';

      // strip \r\n
      for (int i = 0; i < len; i++) {
        if (buf[i] == '\r' || buf[i] == '\n') {
          buf[i] = '\0';
          break;
        }
      }

      if (buf[0] == 'T') {
        int h, m, s, dow, day, mon, year;
        if (sscanf(buf + 1, "%d:%d:%d %d %d/%d/%d", &h, &m, &s, &dow, &day,
                   &mon, &year) == 7) {
          DS3231_PowerOn();
          HAL_Delay(5);
          DS3231_Init();
          DS3231_SetTime(s, m, h, dow, day, mon, year);
          DS3231_PowerOff();
          LOGF("Time synced: %02d:%02d:%02d %02d/%02d/%04d\r\n", h, m, s, day,
               mon, year);
          LED_Toggle();
          HAL_Delay(50);
          LED_Toggle();

          return;
        }
      }
    }
    HAL_Delay(10);
  }
  LOGF("No time sync received\r\n");
  LED_Toggle();
  HAL_Delay(50);
  LED_Toggle();
  LED_Toggle();
  HAL_Delay(50);
  LED_Toggle();
}

/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void) {
  /* USER CODE BEGIN Error_Handler_Debug */
  LOGF("Error_Handler: code=%d\r\n", (int)g_error_code);

  // Turn off relay and opamps to save power (optional, depending on
  // error)
  Relay_SetBypassMode();
  Opamps_Disable(&hdac1);

  // Blink error code
  LED_BlinkStatusCode((uint8_t)g_error_code);

  __disable_irq();
  while (1) {
    // Stay here - reset or power cycle needed
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line) {
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line
     number, ex: printf("Wrong parameters value: file %s on line %d\r\n",
     file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
